app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = Post::orderBy('created_at', 'desc')->paginate(4);
---
select * from `posts` order by `created_at` desc limit 4 offset 0
select count(*) as aggregate from `posts`

    public function destroy(Post $post)
    {
        $post->delete();
---
delete from `posts` where `id` = 12